Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: ང་ཡང་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དུ་སོང་སྟེ།
en: Then I went to a forest of ascetic practice, and, having gone forth as a ṛṣi, I lived the holy life.

source: དྲང་སྲོང་གི་རབ་ཏུ་འབྱུང་བས་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིང་ལྷོ་ཕྱོགས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་དང་ཧ་ཅང་ཡང་མི་རིང་བའི་ནགས་ཁྲོད་ཅིག་ན་ནགས་ཀྱི་རྩ་བ་དང་འབྲས་བུ་ཟ་ཞིང་། ཤིང་ཨུ་དུམ་བཱ་རའི་དྲུང་ན་བསམ་གཏན་སྒོམ་ཞིང་འདུག་འདུག་ནས་མཐར་གྱིས་མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་པར་གྱུར་ཏོ།
en: In the forest, which was not far from the great southern ocean, I ate the plants and fruits of the forest, and sat meditating in dhyāna at the foot of a fig tree until I attained the five clairvoyances. “

source: །ཡང་དེའི་ཚེ་ན་འཛམ་བུའི་གླིང་གི་ཚོང་པ་ལྔ་བརྒྱ་ཞིག་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་པ་དང་། དེ་དག་གིས་ཀྱང་དེ་ནས་རིན་པོ་ཆེའི་ཕུང་པོ་མང་དུ་རྙེད་དོ།
en: Then, at that time, five hundred merchants of Jambudvīpa set out onto the great ocean, where they discovered heaps of jewels.

source: །དེ་ན་དེད་དཔོན་ཟླ་བ་ཞེས་བྱ་བ་སྐྱེས་བུ་སྐལ་བ་དང་ལྡན་ཞིང་མཛངས་པ་ཞིག་ཡོད་པ་དེས་ཀྱང་ཡིད་བཞིན་གྱི་ནོར་བུ་རྙེད་ནས།
en: The head merchant, a fortunate and discerning man named Candra, found a wish-fulfilling jewel.

source: དེ་དག་རིན་པོ་ཆེའི་གླིང་དེ་ནས་ནོར་བུ་རིན་པོ་ཆེའི་ཕུང་པོ་རྒྱ་ཆེན་པོ་དང་། ཡིད་བཞིན་གྱི་ནོར་བུ་དེ་ཁྱེར་ཏེ་ཕྱིར་འཕགས་པ་དང་། དེ་ནས་རྒྱ་མཚོ་ཡང་འཁྲུགས། ཀླུ་རྣམས་ཀྱང་ཁྲོས། གང་དག་དེ་ན་གནས་པའི་ལྷ་རྣམས་ཀྱང་ངུའོ།
en: When they were departing from the island of jewels, taking with them the vast heap of jewels and the wish-fulfilling jewel, the ocean became stormy, the nāgas who dwelt in it became angry, and the devas who lived on that island wailed.

source: །དེ་ན་དྲང་སྲོང་དབུགས་འབྱིན་ཅེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་ཞིག་ཀྱང་སྔོན་གྱི་སྨོན་ལམ་གྱིས་དེར་སྐྱེས་ནས་སེམས་ཅན་ཆེན་པོ་དེས་འགྲོན་པོ་དེ་དག་བདེ་ཞིང་བཀྲ་ཤིས་པར་རྒྱ་མཚོ་ཆེན་པོ་ལས་བསྒྲལ་ཏོ།
en: A bodhisattva ṛṣi named Āśvasta had been born there through the power of his previous prayers, and that mahāsattva successfully and safely rescued those merchants from the great ocean.

source: །སྲིན་པོ་གདུག་པ་ཕྱིར་རྒོལ་ཞིང་གླགས་ལྟ་ལ། སྐབས་ཚོལ་བ་ཞིག་ཀྱང་འགྲོན་པོ་དེ་དག་གི་ཕྱི་བཞིན་རྗེས་སུ་འབྲང་བར་གྱུར་ནས།
en: Then a certain malevolent rākṣasa who was an enemy of the head merchant, seeking an opportunity to destroy him, followed after the merchants.

source: དེ་ནས་ཞག་བདུན་གྱི་བར་དུ་རླུང་མར་དྲག་པོ་དང་། ཆར་པ་ཆེན་པོ་བབས་ནས།
en: He caused extremely fierce wind and rain that lasted for seven days.

source: དེས་ཚོང་པ་དེ་དག་ལམ་རབ་ཏུ་སྟོར་ཏེ་ཤིན་ཏུ་སྐྲག་ནས་སྒྲ་ཆེན་པོས་ངུ་ཞིང་ཆོ་ངེས་འདེབས་ལ་སྨྲེ་སྔགས་འདོན་ཅིང་ལྷ་དང་། གུ་ལང་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་ལ་གསོལ་བ་འདེབས་པ་ནས། ཕ་དང་མ་དང་སྡུག་པའི་བུ་རྣམས་ཞེས་བྱ་བའི་བར་དུ་ངུ་འབོད་པར་བྱེད་པ་ངའི་ལྷའི་རྣ་བས་ཐོས་ནས།
en: The merchants lost their way, became very frightened, and loudly wailed, cried out, and lamented, praying to deities, to Śiva and Varuṇa, and crying out to their parents and beloved children.

source: ང་ལམ་ཇི་སྲིད་པ་དེར་སོང་སྟེ། ཚོང་པ་དག་ལ་མ་འཇིགས་ཤིག །
en: With my divine hearing I heard them, so I went to the merchants and reassured them, saying, ‘I have arrived!

source: མ་འཇིགས་ཤིག་དང་།
en: Don’t be afraid!

source: ངས་ཁྱེད་ཅག་ལ་ལམ་བསྟན་པར་བྱ་ཞིང་།
en: I will show you the way!

source: འཛམ་བུའི་གླིང་དུ་བདེ་ཞིང་བཀྲ་ཤིས་པར་ཕྱིན་པའི་བར་དུ་བྱའོ་ཞེས་ཚོང་པ་རྣམས་དབུགས་ཕྱུང་ནས།
en: I will take you safely and successfully to Jambudvīpa.’ “

source: དེའི་ཚེ་ངས་རས་ཏིལ་མར་གྱིས་བསྐུས་ཏེ་རང་གི་ལག་པ་དཀྲིས་ནས་མེ་འབར་བར་བྱས་ཏེ་བདེན་པའི་ཚིག་བརྗོད་པ། གལ་ཏེ་བདག་གིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དང་ཕན་པའི་ཕྱིར་ལོ་ཉི་ཤུ་རྩ་དྲུག་ཏུ་ཚངས་པའི་གནས་པ་བཞི་པོ་དག་གིས་ནགས་ཁྲོད་དུ་གནས་ཏེ། ནགས་ཀྱི་རྩ་བ་དང་། འབྲས་བུ་ཟ་ཞིང་ཀླུ་དང་གནོད་སྦྱིན་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་སེམས་ཀྱི་རྒྱུད་ཡོངས་སུ་སྨིན་པར་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་པ་ལྟ་ན།
en: At that time I soaked a length of cotton in sesame oil, wound it around my hand, set it alight, and spoke these words of truth: ‘If I, in order to help and benefit beings, have for twenty-six years dwelt in a forest, practicing the four brahmavihāras, and eating the plants and fruits of the forest, and if I have ripened the minds of 84,000 nāgas and yakṣas, bringing them to irreversible progress to the highest, most complete enlightenment, then through that truth, through those true words, and through the ripening of those good roots, may my hand burn so that these merchants will find their way, and safely and successfully reach Jambudvīpa.’ “

source: བདེན་པ་དང་བདེན་པའི་ཚིག་དེ་དང་། དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པ་དེས་བདག་གི་ལག་པ་འབར་བར་འགྱུར་ཞིང་ཚོང་པ་རྣམས་ཀྱིས་ལམ་རྙེད་པར་གྱུར་ཏེ། འཛམ་བུའི་གླིང་དུ་བདེ་ཞིང་བཀྲ་ཤིས་པར་ཕྱིན་པར་གྱུར་ཅིག་ཅེས་བདེན་པའི་ཚིག་བརྗོད་པ་དང་། ཉིན་མཚན་བདུན་གྱི་བར་དུ་ངའི་ལག་པ་དེ་འབར་བར་གྱུར་ནས་ཚོང་པ་དེ་དག་འཛམ་བུའི་གླིང་དུ་བཀོད་དོ།
en: I spoke those words of truth and for seven days and nights my hand burned, and I brought those merchants to Jambudvīpa.

source: །དེར་ངས་སྨོན་ལམ་བཏབ་པ། གལ་ཏེ་གང་གི་ཚེ་འཛམ་བུའི་གླིང་ན་རིན་པོ་ཆེ་མེད་པར་གྱུར་པ་དེའི་ཚེ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལྟ་ན་བདག་གི་བསམ་པ་འདི་ཡང་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: Then I prayed, ‘If I am to attain the complete enlightenment of perfect buddhahood, then when there is a time of scarcity of jewels in Jambudvīpa, may this wish of mine be fulfilled.

source: བདག་འཛམ་བུའི་གླིང་དུ་དེད་དཔོན་དུ་གྱུར་ལ་ལན་བདུན་གྱི་བར་དུ་ཡིད་བཞིན་གྱི་ནོར་བུ་བླངས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་གླིང་ཐམས་ཅད་ཀྱི་བར་དུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཆར་མངོན་པར་རབ་ཏུ་འབེབས་པར་གྱུར་ཅིག །
en: May I become a head merchant in Jambudvīpa, find a wish-fulfilling jewel seven times, and cause a rain of various jewels to fall on all the continents in this buddha realm.

source: དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་སྙིགས་མ་ལྔ་དང་ལྡན་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་ཡང་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཆར་དག་མངོན་པར་རབ་ཏུ་འབེབས་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་པ་དང་།
en: In the same way, may I cause a rain of various jewels, as previously described, to fall on the empty buddha realms with the five degeneracies in the ten directions, which are as numerous as the grains of sand in the Ganges River.’ “

source: དེ་བཞིན་དུ་ངའི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏེ། བསྐལ་པ་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་ཀྱི་བར་དུ་ང་དེད་དཔོན་དུ་གྱུར་ནས། སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་རིན་པོ་ཆེའི་ཆར་དག་རབ་ཏུ་ཕབ་སྟེ།
en: My aspiration was fulfilled, and I became a head merchant throughout as many great eons as there are grains of sand in the Ganges River and caused a rain of jewels to fall on empty buddha realms with the five degeneracies, which were as numerous as the grains of sand in the Ganges River.

source: གླིང་རེ་རེར་ཡང་ལན་བདུན་བདུན་དུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཆར་དག་མངོན་པར་རབ་ཏུ་ཕབ་བོ།
en: In each continent I caused a rain of various jewels to fall seven times.

source: །དེ་ལྟར་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་རིན་པོ་ཆེ་དག་གིས་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ཤིང་ཐེག་པ་གསུམ་པོ་དག་ལ་ཡང་ངེས་པར་སྦྱར་ཏོ།
en: In that way I fulfilled the wishes of countless, innumerable beings through those jewels, and brought them into the three yānas.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་རིན་པོ་ཆེ་ཡོངས་སུ་གཏོང་བའི་དགེ་བའི་རྩ་བ་རྣམ་པར་སྨིན་པའི་མཚན་ཉིད་ལ་ལྟོས།
en: Noble son, observe the qualities of the ripening of the good root of the Tathāgata’s act of giving away jewels! “

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསྐལ་པ་དཔག་ཏུ་མེད་པ་འདས་པའི་འོག་ཏུ་བསྐལ་པ་མགུ་བྱེད་ཅེས་བྱ་བ་བྱུང་བ་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་རབ་རིབ་ཅན་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: Moreover, noble son, after countless eons had passed, there was the eon Saṃtoṣaṇa, in which this buddha realm was called Timira.

source: སྙིགས་མ་ལྔ་དང་ལྡན་ཞིང་སྐྱེ་དགུ་ཚེ་ལོ་ལྔ་སྟོང་པར་གྱུར་པ་ན་ང་སྨོན་ལམ་གྱི་དབང་གིས་འཛམ་བུའི་གླིང་འདིར་རིག་བྱེད་འདོན་པའི་བྲམ་ཟེ་ཉི་ཕྲེང་སྤོས་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: It had the five degeneracies, and when the lifespan of beings was five thousand years, through the power of my prayers, I became in this Jambudvīpa a Veda-reciting brahmin named Sūryamālagandha.

source: དེའི་ཚེ་ན་སེམས་ཅན་རྣམས་ཕལ་ཆེར་རྟག་པར་ལྟ་ཞིང་འཁོན་པ་དང་། ཕ་རོལ་གནོན་པ་དང་བཅས་ལ། འཐབ་པ་ལ་གནས་པ་དང་བཅས་པར་གྱུར་ཏེ།
en: At that time, most beings held the view of eternalism, were hostile, attacked each other, and engaged in disputes.

source: ངས་སེམས་ཅན་དེ་དག་ལ་ཕ་རོལ་གནོན་པའི་སྟོབས་ཆེན་པོའི་ཤུགས་ཀྱིས་ཕུང་པོ་དགྲ་ལྟ་བུར་གྱུར་པའི་རབ་ཏུ་སྦྱོར་བས་ཆོས་བསྟན་ཏོ། །སྐྱེ་མཆེད་གྲོང་སྟོང་པ་ལྟ་བུར་སོ་སོར་བརྟགས་པ་དང་། རྐྱེན་གྱིས་རྗེས་སུ་འབྲེལ་བ་སྐྱེ་བ་དང་འཇིག་པ་དང་བཅས་པ་དང་། དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་རྗེས་སུ་དྲན་པའི་ཡིད་ལ་བྱེད་པ་ཡང་བསྟན་ཏེ།
en: Through the power of my strength in defeating opponents, I taught them the Dharma that the aggregates were the enemies, and I taught them to examine the sensory bases that are like an empty village, arising and ceasing in accordance with dependent origination, and to focus on mindfulness of inhalation and exhalation.

source: དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོ་བ་ལ་མངོན་པར་སྦྱར་ནས་ང་ཉིད་ཀྱང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་གྱུར་ཏེ། དེའི་ཚེ་ན་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཀྱང་ང་ཡིས་གདམས་ཤིང་རྗེས་སུ་བསྟན་པ་ལ་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་གྱུར་ཏོ།
en: I made them dedicate the good roots from developing the aspiration for the highest, most complete enlightenment. I myself had attained the five clairvoyances, and at that time I instructed and taught countless, innumerable beings who thereby obtained the five clairvoyances themselves.

source: །དེ་བཞིན་དུ་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཀྱང་འཐབ་མོ་དང་། རྩོད་པ་དང་། ཁོན་དུ་འཛིན་པ་དག་སྤངས་ཏེ། ནགས་ཁྲོད་ན་གནས་ཤིང་ནགས་ཁྲོད་ན་རྩ་བ་དང་འབྲས་བུ་ཟ་ལ་བསམ་གཏན་སྒོམ་ཞིང་ཚངས་པའི་གནས་པ་བཞི་པོ་དག་གིས་ཉིན་མཚན་འདའ་བར་བྱེད་དོ།
en: In the same way countless, innumerable beings gave up fighting, quarreling, and enmity and went to stay in the forests, where they ate the plants and fruit of the forest, meditated in dhyāna, and remained in the brahmavihāras day and night. “

source: །དེ་ནས་གང་གི་ཚེ་བསྐལ་པ་དེ་ཟད་དུ་ཉེ་བ་ན་སྦྱིན་གནས་དེ་དག་གིས་འཛམ་བུའི་གླིང་མཐའ་དག་ཁྱབ་པར་གྱུར་ཏོ། །འཐབ་མོ་དང་། འཐབ་པ་དང་། གཡུལ་དང་། འཁོན་པ་དང་།
en: Then at the time when the eon was close to ending, those venerable ones spread throughout Jambudvīpa, and conflict, fighting, wars, enmity, and quarreling ceased completely.

source: འགྱེད་པ་དང་། རྩོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཞི་བར་གྱུར། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་པ་དག་ཀྱང་རབ་ཏུ་ཞི།
en: Untimely wind and rains ceased.

source: ས་ལ་རྟེན་པའི་ལོ་ཏོག་རྣམས་ཀྱང་ལེགས་པར་སྨིན་ཅིང་མདངས་དང་ལྡན་པར་གྱུར་ན་དུས་ཀྱི་ཉེས་པས་ནད་སྣ་ཚོགས་ཀྱིས་ཉེན་པ་འབའ་ཞིག་ཏུ་གྱུར་ནས་དེའི་ཚེ་ང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Excellent harvests grew from fertile soil. There were only the misfortunes of various illnesses caused by the bad nature of the age. “

source: འདི་ལྟར་བདག་གིས་སེམས་ཅན་རྣམས་ཀྱི་ནད་ཞི་བར་བྱེད་མ་ནུས་སོ་སྙམ་ནས། དེའི་ཚེ་ངས་འདི་སྙམ་དུ་བསམས་ཏེ། གང་དག་བདག་གིས་བརྒྱ་བྱིན་དང་། ཚངས་པ་ཆེན་པོ་དང་། འཇིག་རྟེན་སྐྱོང་དང་།
en: At that time, I thought, ‘I have not been able to soothe the illnesses of beings.’

source: གཞན་ཡང་ལྷའི་དྲང་སྲོང་རྣམས་དང་། ཀླུའི་དྲང་སྲོང་རྣམས་དང་། བརྒྱ་བྱིན་གྱི་དྲང་སྲོང་རྣམས་དང་། མིའི་དྲང་སྲོང་རྣམས་ཀྱང་བསགས་ལ། སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་སྨན་སྦྱར་བའི་བསྟན་བཅོས་དག་བསྟན་པར་བྱའོ་སྙམ་ནས་དེའི་ཚེ་ང་རྫུ་འཕྲུལ་གྱིས་སོང་སྟེ།
en: It then occurred to me, ‘I should bring together Śakra, great Brahmā, the guardians of the world, and other ṛṣis among the devas, nāgas, śakras, and humans, and have them produce a treatise on medical treatments for the sake of beings.’

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་དང་། ལྷའི་དྲང་སྲོང་རྣམས་དང་། ཀླུའི་དྲང་སྲོང་རྣམས་དང་།
en: I then traveled miraculously and informed Śakra, great Brahmā, the guardians of the world, as well as the ṛṣis among the devas, nāgas, śakras, and humans.

source: བརྒྱ་བྱིན་གྱི་དྲང་སྲོང་རྣམས་དང་། མིའི་དྲང་སྲོང་རྣམས་ལ་བསྒོ་ནས་རི་ལན་ཚྭའི་བདག་པོ་གཅིག་པ་ཞེས་བྱ་བ་ལན་ཚྭ་སྤྱོད་པའི་རྩེ་མོར་ངེས་པའི་གནས་ཞེས་བྱ་བ་དེར་བསྡུས་ནས་འབྱུང་པོ་ཡང་དག་པར་ཟློག་པ་སོ་སོར་འབྲང་ཞིང་བསྲུང་ལ། རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་རབ་ཏུ་ཞི་བར་བྱེད་པའི་བསྟན་བཅོས་དག་རབ་ཏུ་བསྟན་ཏོ།
en: They gathered at a place named Viḍacaraka Summit on Ekaviḍapati Mountain and revealed a treatise on the warding off and restraining of bhūtas, on protection, and on the alleviation of wind, bile, and phlegm.

source: །དེ་བཞིན་དུ་སྦྱར་ཏེ་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་གི་ནད་རྣམས་ཀྱང་རབ་ཏུ་ཞི་བར་བྱས་སོ། །དེར་ངས་ཇི་ལྟར་སྨོན་ལམ་ཆེན་པོ་བཏབ་པ་བཞིན་དུ་ཉི་མ་གཅིག་ལ་ཡང་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་རྣམས་ཀྱི་ཤེས་རབ་སྣང་བར་བྱས་ཤིང་ཐེག་པ་གསུམ་པོ་དག་ལ་ངེས་པར་སྦྱར་ནས་ངན་སོང་གི་ལམ་རྣམས་ནི་བཅད། མཐོ་རིས་ཀྱི་ལམ་དག་ལ་ནི་རབ་ཏུ་བཀོད་དེ། ནད་སྣ་ཚོགས་རབ་ཏུ་ཞི་བར་བྱས་ཤིང་ཡོངས་སུ་ཐར་བར་བྱས་པ་དང་།
en: By applying it I cured countless, innumerable beings of their illnesses.⁠ “Then I prayed that in a single day I would make the wisdom of countless, innumerable beings shine, bring them into the three yānas, close their doorways to the lower existences, put them on the road to the higher existences, and cure and free them from various illnesses.

source: དེ་བཞིན་དུ་སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་ལ་ཡེ་ཤེས་ཀྱི་སྣང་བ་བྱིན་ཏེ།
en: In that way, I gave the light of wisdom to countless beings and established them in happiness.

source: བདེ་བ་ལ་བཀོད་པའི་དགེ་བའི་རྩ་བ་རྣམ་པར་སྨིན་པ་དེས་ན་རིགས་ཀྱི་བུ་ངའི་སྨོན་ལམ་གྱི་རེ་བ་དེ་ཡོངས་སུ་རྫོགས་སོ།
en: Noble son, through the ripening of my good roots, this prayer was fulfilled.

source: །གང་གི་ཚེ་ངས་ཉི་མ་གཅིག་ལ་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་གི་ངན་སོང་གི་ལམ་རྣམས་བཀག་ཅིང་། མཐོ་རིས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་དེ།
en: In a single day I shut the doors to lower existence for countless, innumerable beings and put them on the road to higher existence.

source: ངས་ནད་པ་རྣམས་ཀྱི་ཡོ་བྱད་ཀྱི་དོན་དང་། སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་ལྷའི་དྲང་སྲོང་རྣམས་དང་། གནོད་སྦྱིན་གྱི་ཚོགས་རྣམས་ལྷའི་འཇིག་རྟེན་ལན་ཚྭ་སྤྱོད་པའི་རྩེ་མོར་བསྡུས་ནས་སེམས་ཅན་རྣམས་ཀྱི་ནད་མེད་པ་ལ་མཁས་པ་རབ་ཏུ་བཤད་དོ།
en: In order to devise a system of medical treatments⁠ and to benefit begins, a gathering of devas, ṛṣis, and yakṣas⁠ assembled on Viḍacaraka Summit in the divine realm and revealed the expertise for eliminating the diseases of beings.

source: །དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་རབ་རིབ་ཅན་གྱི་གླིང་ཐམས་ཅད་དུ་ཡང་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་དག་བྱས་ཏེ་སེམས་ཅན་རྣམས་ཀྱང་མཐོ་རིས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་དོ།
en: In that same way, I performed these heroic acts in all of the continents in the buddha realm Timira and established beings on the path to the higher existences.

source: །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། མིའི་དྲང་སྲོང་རྣམས་ཀྱང་བསོགས་ཏེ་དེ་དག་གིས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་རིག་པའི་གནས་སྣ་ཚོགས་དག་རབ་ཏུ་བཤད་དོ།
en: I gathered together devas, nāgas, yakṣas, humans, and ṛṣis for the purpose of revealing various subjects of knowledge for the benefit of beings. “

source: །སངས་རྒྱས་ཀྱི་ཞིང་རབ་རིབ་ཅན་འདིར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་ཡང་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་དག་བྱས་ཏེ། སེམས་ཅན་རྣམས་ཀྱང་ཐེག་པ་གསུམ་པོ་དག་ལ་ངེས་པར་སྦྱར་ཅིང་མཐོ་རིས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་དེ། རིག་པའི་གནས་སྣ་ཚོགས་དག་རབ་ཏུ་བཤད་ནས་ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས་རིགས་ཀྱི་བུ་ངའི་བླ་ན་མེད་པའི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་སོ། །ཡང་སངས་རྒྱས་ཀྱི་ཞིང་རབ་རིབ་ཅན་གྱི་གླིང་ཐམས་ཅད་དུ་ཇི་ལྟར་སྔར་སྨོན་ལམ་བཏབ་པ་བཞིན་དུ་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱིས་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་དག་བྱས་པ་དེ་བཞིན་དུ།
en: Just as I had done in the buddha realm Timira, I performed these heroic acts in buddha realms with the five degeneracies in the ten directions, which were as numerous as the grains of sand in the Ganges River, and brought those beings into the three yānas, established them on the path to the higher existences, taught the various subjects of knowledge, and freed them from all illness.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་སྙིགས་མ་ལྔ་དང་ལྡན་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེའི་གླིང་ཐམས་ཅད་དུ་ཡང་ངས་ཇི་ལྟར་སྔོན་སྨོན་ལམ་བཏབ་པ་བཞིན་དུ་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་དག་ཀྱང་བྱས་ཏེ།
en: In that way, noble son, my unsurpassable aspiration was fulfilled. “Just as I had prayed to perform through unsurpassable wisdom heroic deeds in all the continents in the buddha realm Timira, I also performed them in empty buddha realms that had the five degeneracies in the ten directions, which were as numerous as the grains of sand in the Ganges River. I performed those heroic deeds in all the continents in each of those buddha realms, just as I had prayed to do. Noble son, in that way I accomplished what I had prayed for.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཤེས་རབ་ཀྱི་ཁྱད་པར་དང་། དེ་བཞིན་གཤེགས་པའི་ལེགས་པར་སྤྱད་པ་གསུམ་གྱི་དགེ་བའི་རྩ་བའི་ས་བོན་དེ་ལ་ལྟོས།
en: Observe, noble son, the special wisdom of bodhisattva conduct, and this seed of the good roots of the Tathāgata’s three excellent activities. “

source: དེ་བཞིན་དུ་བསྐལ་པ་གྲངས་མེད་པ་ལས་ཤིན་ཏུ་ལྷག་པ་སྙེད་འདས་པ་ན་དུས་ངན་པའི་ཚེ་བསྐལ་པ་ཆེན་པོ་ལེགས་བཅས་ཞེས་བྱ་བ་བྱུང་བ་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་རྣམ་རྒྱལ་སྒྲ་དབྱངས་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: In the same way, at a later time, after many countless eons had passed, when the five degeneracies were increasing in the great eon Saṃśrayasa, this buddha realm had the name Vijitaghoṣa.

source: དེ་ཡང་སྙིགས་མ་ལྔ་དང་ལྡན་པར་གྱུར་ནས་ཤར་ཕྱོགས་ལོགས་སུ་གླིང་བཞི་པ་ལྔ་བཅུ་འདས་པ་ན་འཛམ་བུའི་གླིང་དགའ་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་བར་གྱུར་ཏེ།
en: To the east, beyond fifty worlds of four continents, there was a Jambudvīpa called Vaḍa.

source: དེར་ཡང་ང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྐྱེས་ནས་གླིང་བཞིའི་དབང་ཕྱུག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ནམ་མཁའ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: I took birth there in order to ripen beings. I became a cakravartin named Ambara who ruled over the four continents.

source: །དེར་ཡང་སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: There I made beings obtain, enter, and remain in the path of the ten good actions.

source: །ཐེག་པ་གསུམ་པོ་དག་ཀྱང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: I made them obtain, enter, and remain in the three yānas.

source: །ཐམས་ཅད་སྦྱིན་ཞིང་ཀུན་ལ་སྦྱིན་པར་ཡང་གྱུར་ཏོ།
en: I gave away everything, giving to all.

source: །དེ་ངའི་གན་དུ་སློངས་མོ་པ་དག་འོངས་ནས་འདི་ལྟ་སྟེ་དབྱིག་དང་། གསེར་དང་། ཨན་ད་རྙིལ་དང་། རིན་པོ་ཆེ་མཐོན་ཀ་ཆེན་པོ་དང་།
en: Petitioners came before me asking for all kinds of precious things, such as gold coins,and so on, up to and including sapphires, deep blue sapphires, jyotīrasas, and bluestones.

source: སྐར་མདོག་དང་། ཆུ་འདང་གི་བར་གྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་སློང་བར་བྱེད་པའི་སློངས་མོ་པ་རྣམས་ཀྱིས་ཀྱང་རིན་པོ་ཆེ་མང་པོ་དེ་སྙེད་ཐོབ་པར་གྱུར་ཏོ།
en: Those petitioners received the many precious things they asked for. “

source: །དེའི་ཚེ་ན་ངས་བློན་པོ་རྣམས་ལ་དྲིས་པ། རིན་པོ་ཆེ་འདི་དག་ག་ལས་བྱུང་། དེ་དག་གིས་སྨྲས་པ།
en: At that time, I asked my ministers, ‘Where did these jewels come from?’

source: ཀླུའི་རྒྱལ་པོ་རྣམས་ཀྱིས་གཏེར་དག་བསྟན་ཏེ།
en: They answered, ‘They are treasures revealed to us by nāga kings.

source: འཇིག་རྟེན་དུ་གཏེར་དག་བྱུང་བས་རིན་པོ་ཆེ་རྣམས་ཀྱང་བྱུང་བར་གྱུར་ཏེ། ལྷའི་ཞལ་སྔར་སློངས་མོ་པ་ཇི་ཙམ་མཆིས་པ་དེ་ཙམ་ཉི་ཚེ་ལས་མ་བསྟན་ལགས་སོ།
en: These jewels are revealed in this world when the treasures are revealed, but however many petitioners come before Your Majesty, do not tell them anything about this.’ “

source: །དེའི་ཚེ་ངས་སྨོན་ལམ་བཏབ་པ། གལ་ཏེ་བདག་སྙིགས་མ་ལྔ་དང་ལྡན་ཞིང་ཉོན་མོངས་པ་དང་། འཐབ་པ་དང་། རྩོད་པ་བདོ་བར་གྱུར་པའི་འཇིག་རྟེན་དུ་སྐྱེ་དགུ་ཚེ་ལོ་བརྒྱ་པ་རྣམས་ཀྱི་ནང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལྟ་ན་དེའི་ཕྱིར་བདག་གི་རེ་བ་འདི་ཡང་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: At that time, I prayed, ‘If I am going to attain the complete enlightenment of perfect buddhahood in a world that has the five degeneracies, in which there is a great deal of fighting and argument and where the lifespan is a hundred years, then may the aspiration of this prayer of mine be fulfilled.

source: བདག་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གཏེར་སྟོན་པར་བྱེད་པའི་ཀླུའི་རྒྱལ་པོར་འགྱུར་ཞིང་།
en: May I be reborn in this buddha realm as a nāga king who reveals treasures.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་རྒྱལ་སྒྲ་དབྱངས་འདིའི་གླིང་ཐམས་ཅད་ཀྱི་གླིང་རེ་རེར་ཡང་སྐྱེ་བ་ལན་བདུན་བདུན་ལེན་པར་གྱུར་ལ།
en: May I take rebirth seven times in each of the continents in this buddha realm, Vijitaghoṣa.

source: སྐྱེ་བ་རེ་རེ་ཞིང་ཡང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བའི་གཏེར་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་སྟོན་ཅིང་གཏོང་བར་གྱུར་ཅིག །འདི་ལྟ་སྟེ་དབྱིག་དང་། གསེར་དང་།
en: In each lifetime may I reveal and give away hundreds of thousands of millions of trillions of treasures filled with various precious things.

source: ཨན་ད་རྙིལ་དང་། རིན་པོ་ཆེ་མཐོན་ཀ་ཆེན་པོ་དང་། སྐར་མདོག་དང་། ཆུ་འདང་གི་བར་དག་གི་གཏེར་རེ་རེ་ཞིང་ཡང་རྒྱར་དཔག་ཚད་སྟོང་ཡོད་ལ། རིན་པོ་ཆེ་མང་པོས་ཡོངས་སུ་གང་བ་དག་བྱུང་སྟེ།
en: Each treasure will be a thousand yojanas across and filled with various precious things such as gold coins, and so on, up to and including sapphires, deep blue sapphires, jyotīrasas, and bluestones.

source: སེམས་ཅན་རྣམས་ལ་སྟོན་ཅིང་གཏོང་བར་གྱུར་ཅིག །
en: May I reveal these and give them to beings.

source: ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་དཔའ་བོའི་མཐུ་དེ་ལྟ་བུ་དག་བྱེད་པར་འགྱུར་བ་དེ་བཞིན་དུ། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེའི་གླིང་ཐམས་ཅད་དུ་ཡང་སྔར་ཇི་སྐད་སྨོས་པའི་བར་དག་ལྟ་བུར་སྐྱེ་བ་ལན་བདུན་བདུན་འཛིན་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ།
en: Just as I perform that heroic deed in this buddha realm, may I take rebirth seven times in each continent within the buddha realms in the ten directions that have the five degeneracies, which are as numerous as the grains of sand in the Ganges River, and so on, as previously described.’ “

source: །རིགས་ཀྱི་བུ་གང་གི་ཚེ་ངས་སྨོན་ལམ་དེ་ལྟ་བུ་བཏབ་པ་དེའི་ཚེ་ན་ནམ་མཁའི་དཀྱིལ་ནས་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་གྱིས་བར་སྣང་ལས་མེ་ཏོག་གི་ཆར་རབ་ཏུ་ཕབ་ཅིང་ང་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། ཐམས་ཅད་སྦྱིན་པ་ལེགས་སོ་ལེགས་སོ།
en: Noble son, when I made that prayer, a hundred thousand trillion devas appeared in the middle of the sky and sent down a rain of flowers and said, ‘Excellent, Sarvaṃdada, excellent!

source: །ཇི་ལྟར་ཁྱོད་ཀྱིས་སྨོན་ལམ་བཏབ་པ་དེ་བཞིན་དུ་ཁྱོད་ཀྱི་རེ་བ་དེ་ཡང་འགྲུབ་པར་འགྱུར་རོ།
en: Your aspiration will be fulfilled exactly as you have prayed.’

source: །ལྷ་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ནས་རྒྱལ་པོ་ནམ་མཁའི་མིང་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བར་བཏགས་པ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་རྣམས་ཀྱིས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་གིས་འདི་ལ་གང་ཡོངས་སུ་གཏང་བར་དཀའ་བའི་སྦྱིན་པ་དག་བསླང་བར་བྱ་སྟེ། གལ་ཏེ་ཡོངས་སུ་གཏོང་བར་བྱེད་ན་ནི་དེའི་ཚེ་འདིའི་མིང་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བར་འགྱུར་རོ། །ཇི་སྟེ་ཡོངས་སུ་གཏོང་བར་མི་བྱེད་ན་ནི་འདིའི་མིང་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བར་ཡང་མི་འགྱུར་རོ་སྙམ་ནས།
en: The populace heard that the devas in the middle of the sky gave King Ambara the name Sarvaṃdada, and having heard that they thought, ‘We should now ask him for gifts that are hard to give, and if he gives them, then he should have this name Sarvaṃdada, but if he does not give them, then he should not have the name Sarvaṃdada.’ “

source: དེ་ནས་སེམས་ཅན་དེ་དག་གིས་རྒྱལ་པོ་ནམ་མཁའ་ལ་སླས་རྣམས་ཀྱང་བསླངས་བཙུན་མོ་རྣམས་དང་། བཙུན་མོ་དམ་པ་དང་། བུ་དང་། བུ་མོ་དག་ཀྱང་བསླང་བར་བརྩམས་པ་དང་།
en: Those beings then commenced to ask King Ambara for his harem, for Her Majesty, his principal queen, and for his sons and daughters.

source: དེའི་ཚེ་རྒྱལ་པོ་ནམ་མཁའ་སེམས་རབ་ཏུ་དང་བས་བྱིན་ནོ།
en: King Ambara gave them away with delight. “

source: །དེ་དག་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། བཙུན་མོ་ཡོངས་སུ་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་འདི་ལ་དཀའ་བ་མ་ཡིན་གྱིས་བདག་ཅག་གིས་རྒྱལ་པོ་ནམ་མཁའ་ལ་ཡན་ལག་དང་། ཉིང་ལག་གང་ཡིན་པ་དག་བསླང་བར་བྱ་སྟེ།
en: Then they thought, ‘His giving away his queen was not difficult, so we should ask King Ambara for his limbs and the smaller parts of his body.

source: གལ་ཏེ་སྟེར་ན་ནི་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བར་འགྱུར་རོ། །ཇི་སྟེ་མི་སྟེར་ན་ནི་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བར་ཡང་མི་འགྱུར་རོ་སྙམ་པ་དང་།
en: If he gives them, then he will be Sarvaṃdada, but if he does not give them, then he will not be Sarvaṃdada.’

source: དེ་ནས་བྲམ་ཟེ་སྐར་མ་ལ་དགའ་བ་ཞེས་བྱ་བ་དེ་རྒྱལ་པོ་ནམ་མཁའི་མདུན་དུ་འདུག་སྟེ་སྨྲས་པ། ཐམས་ཅད་སྦྱིན་པ་རྒྱལ་སྲིད་བདག་ལ་སྩོལ་ཅིག །
en: A young brahmin named Jyotīrasa then came before King Ambara and said, ‘Sarvaṃdada, give me your kingdom!’
